eisup_2019_docmng_integration/src/InformationRegisters/МестаХраненияНоменклатуры/МестаХраненияНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>МестаХраненияНоменклатуры</name>
  <comment>(Упр)</comment>
  <resources>
    <name>МестоХранения</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Приоритет</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

eisup_2019_docmng_integration/src/InformationRegisters/МестаХраненияНоменклатуры/RecordSetModule.bsl
// Процедура вызывается перед записью набора регистра сведений
//
Процедура ПередЗаписью(Отказ, Замещение)

	Если НЕ ОбменДанными.Загрузка Тогда

		Для каждого ЗаписьРегистра Из ЭтотОбъект Цикл

			Если НЕ ЗначениеЗаполнено(ЗаписьРегистра.Номенклатура) Тогда
				ttk_ОбщегоНазначения.СообщитьОбОшибке("Номенклатура должна быть заполнена обязательно!", Отказ);
			ИначеЕсли ЗаписьРегистра.Номенклатура.Услуга Тогда
				ttk_ОбщегоНазначения.СообщитьОбОшибке("Номенклатура не может быть услугой!", Отказ);
			КонецЕсли;

			Если НЕ ЗначениеЗаполнено(ЗаписьРегистра.Склад) Тогда
				ttk_ОбщегоНазначения.СообщитьОбОшибке("Склад должен быть заполнен обязательно!", Отказ);
			КонецЕсли;

			Если НЕ ЗначениеЗаполнено(ЗаписьРегистра.МестоХранения) Тогда
				ttk_ОбщегоНазначения.СообщитьОбОшибке("Место хранения должно быть заполнено обязательно!", Отказ);
			КонецЕсли;

		КонецЦикла;

	КонецЕсли;

КонецПроцедуры
